Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A27B.tmx
Source language: en_us
Languages: zh_cn

source: Genetic or Not, Gay Won’t Go Away
zh_cn: 不管是不是天生如此，同性依然恋！

source: That has long been one of the rallying cries of a movement, and sometimes the gist of its argument.
zh_cn: 同性恋是天生的，这一说法早已成为一场运动的战斗口号，并且很多时候成为该运动所引发的争论的主旨。

source: Across decades of widespread ostracism, followed by years of patchwork acceptance and, most recently, moments of heady triumph, gay people invoked that phrase to explain why homophobia was unwarranted and discrimination senseless.
zh_cn: 虽然同性恋数十年来备受公众排斥，可近几年却在星星点点的地方得到了认可，并且就在最近，些许迹象表明越来越多的人的开始理解和接受同性恋行为。同性恋人群甚至援引“天生”这个词来解释为什么同性恋恐惧症是没有任何理论依据而且对同性恋的歧视也是毫无意义的。

source: Lady Gaga even spun an anthem from it.
zh_cn: Lady GaGa甚至从中得到灵感创作了一首同性恋赞美歌。

source: But is it the right mantra to cling to?
zh_cn: 但这就是一首值得赞颂的赞歌吗？

source: The best tack to take?
zh_cn: 这就是我们所能采取的最好行为态度吗？

source: Not for the actress Cynthia Nixon, 45, whose comments in The New York Times Magazine last Sunday raised those very questions.
zh_cn: 这对45岁的女演员辛西娅?尼克松（ Cynthia Nixon）来说并不是这样的，她上周日在《纽约时代杂志》的一番评论引发了上面的两个思考。

source: For 15 years, until 2003, she was in a relationship with a man. They had two children together.
zh_cn: 直到2003年，她15年以来一直跟一名男子沐浴在爱河里，并且他们总共育有2个孩子。

source: She then formed a new family with a woman, to whom she’s engaged.
zh_cn: 然后她又和一名女子订婚并组建了一个新的家庭。

source: And she told The Times’s Alex Witchel that homosexuality for her “is a choice.”
zh_cn: 她还透露给《纽约时报》的阿列克斯?威切尔（Alex Witchel）说同性恋对她自己来说是一种“选择”。

source: “For many people it’s not,” she conceded, but added that they “don’t get to define my gayness for me.”
zh_cn: 她承认“对于很多人来说并不是这样的”，并且还补充道“他们是不会理解同性恋对我来说意味着什么。”

source: They do get to fume, though. Last week some did.
zh_cn: 即便如此，听到她这一席话的有些同性恋人群还是发火了，就在上周他们就按捺不住心中的怒火而开始抗议了。

source: They complained that she represented a minority of those in same-sex relationships and that she had furthermore handed a cudgel to our opponents, who might now cite her professed malleability as they make their case that incentives to change, not equal rights, are what we need.
zh_cn: 他们抱怨道她只是代表着一小部分同性恋者，并且她的言论会进一步给那些反对同性恋人群以更好的把柄来攻击我们。那些反对者会抓住她所声称的“可选择性”来大做文章，从而使得“主动选择性倾向”变得有道理。

source: But while her critics have good reason to worry about how her words will be construed and used, they have no right to demand the kind of silence and conformity from Nixon that gay people have justly rebelled against.
zh_cn: 我们需要的是她的这种给对手把柄的行为，而不是争取平等的权力。 但是虽然评论她的人有充分的理由为她的言论组织方法和用意而感到焦虑，但是他们并没有权力让尼克松（Nixon）缄口不言或者遵循他们的意志，即使她刚刚遭到同性恋人群恰到好处的评判。

source: She’s entitled to her own truth and manner of expressing it.
zh_cn: 毕竟她有表达自己所坚信的真理的权力。

source: Besides which, there are problems with some gay advocates’ insistence that homosexuality be discussed and regarded as something ingrained at the first breath.
zh_cn: 除此之外，一些同性恋支持者坚持认为同性恋行为应该被拿来讨论，并且作为一种生而有之的事情拿来对待，这些同性恋支持者也同样遇到了问题。

source: By hinging a whole movement on a conclusion that hasn’t been — and perhaps won’t be — scientifically pinpointed and proved beyond all doubt, they hitch it to a moving target.
zh_cn: 通过把整个运动建立在一个尚未或者将来也不会被科学所严密地论证，并且被证明不包含丝毫疑问在里面的理论上面，这种行为就好像他们把自己钩挂在一个运动的目标上面。

source: The exact dynamics through which someone winds up gay are “still an open question,” said Clinton Anderson, the director of the Lesbian, Gay, Bisexual and Transgender Concerns Office of the American Psychological Association.
zh_cn: 美国 Lesbian, Gay, Bisexual and Transgender Concerns Office of the American Psychological Association（心理学协会男女同性恋，双性者，变性者事务部）主任克林顿?安德森（Clinton Anderson）说，人们把同性恋者惹毛的确切作用方式仍然是个未解决的问题。

source: “There is substantial evidence of various connections between genes, brain, hormones and sexual identity,” he said.
zh_cn: 有确凿证据可以证明基因，大脑，荷尔蒙和性的自我认同之间有多种多样的联系。

source: “But those do not amount to a simple picture that A leads to B.”
zh_cn: 但那还不足以说明他们之间的确切关系。

source: One landmark study looked at gay men’s brothers and found that 52 percent of identical twin brothers were also gay, in contrast with only 22 percent of nonidentical twin brothers and 11 percent of adoptive, genetically unrelated brothers.
zh_cn: 一个调查男同性恋者的兄弟的具有划时代意义的研究显示，有52%的同卵双生双胞胎也是同性恋者，而在非同卵双生双胞胎兄弟和被收养的（没有任何遗传关系的）兄弟之间的同性恋则分别占调查总数的22%和11%，两者形成了鲜明对比。

source: Heredity more than environment seemed to be calling the shots.
zh_cn: 看起来是遗传因素而不是环境因素在促成同性恋方面起着重要作用。

source: Other research has posited or identified common anatomical and chromosomal traits among gay men or lesbians, and there’s discussion of a gay gene or, rather, set of genes in the mix.
zh_cn: 其他研究则已经假想或者辨认出存在于男女同性恋者身上共有的解剖学和染色体上面的特点，并且对待“同性恋基因”或者说是一组与同性恋有关系的基因上的不同看法仍在讨论当中。

source: The push to isolate it is entwined with the belief that establishing that sexual orientation is like skin color — an immutable matter of biology — will make homophobia as inexcusable as racism and winnow the ranks of haters.
zh_cn: 那些支持把这些基因分离出来的人认为建立起那种性取向就像是把肤色作为一种生物特性一样使得同性恋恐惧症变得和种族主义一样不可饶恕，甚至还可以把恐惧症人群分出层次。而希望把这两个研究孤立起来的人大多数都夹杂着这种看法。

source: But bigotry isn’t rational.
zh_cn: 但这种偏执的行为并不理智。

source: Finding a determinative biological quirk, deviation or marker could prompt religious extremists who now want gays in reparative psychotherapy to focus on medical interventions instead. And a person’s absence of agency over his or her concentration of melanin has hardly ended all discrimination against blacks.
zh_cn: 因为这种寻找一个决定性的生物学怪现象或者误差或者标记的行为很可能促使宗教极端主义者把应该让同性恋者参与修复性精神疗法的想法转化为应该让他们参与医疗干预疗法，并且一个人的对黑色素浓度的忽视并不能完全终结大多数人对黑人的歧视。

source: What’s more, the born-this-way approach carries an unintended implication that the behavior of gays and lesbians needs biological grounding to evade condemnation.
zh_cn: 此外，这种“生来就有”的想法无意中带着一种暗示，也就是暗示同性恋者的行为需要借助生物学理论依据来规避社会谴责。

source: Why should it?
zh_cn: 为什么应该是这样呢？

source: Our laws safeguard religious freedom, and that’s not because there’s a Presbyterian, Buddhist or Mormon gene.
zh_cn: 我们的法律捍卫我们的宗教自由，但那并不是因为存在着叫做长老会（基督教新教教会管理体制），佛教或者摩门教（耶稣基督后期圣徒教会）的基因。

source: There’s only a tradition and theology that you elect or decline to follow.
zh_cn: 而是只存在着一种惯例或者理论，也就是你被选为信仰或者拒绝信仰宗教的理论。

source: But this country has deemed worshiping in a way that feels consonant with who you are to be essential to a person’s humanity.
zh_cn: 但是，这个国家已经认为以一种与自我认知相符合的方式来进行敬奉对于一个人的人性是十分重要的。

source: So it’s protected.
zh_cn: 因此这是受保护的。

source: Our laws also safeguard the right to bear arms: not exactly a biological imperative.
zh_cn: 我们的法律也保护持有枪械的权力：这也不完全是出于生物学上的需要。

source: Among adults, the right to love whom you’re moved to love — and to express it through sex and maybe, yes, marriage — is surely as vital to life, liberty and the pursuit of happiness as a Glock.
zh_cn: 在成年人当中，去爱你后来“通过感知”而爱上的人并且通过性爱或者婚姻来表达你的爱，这种权力对于生命，对于自由以及对幸福的追求（就如同对格洛克（著名的格洛克手枪系列）的追求是一样的道理）是十分重要的。

source: And it’s a lot less likely to cause injury, if that’s a deciding factor: how a person’s actions affect the community around him or her.
zh_cn: 如果把这种追求也算作一种决定性因素的话，那么这种行为对你所追求的他（或者她）的周围的人将几乎不会构成危害。

source: I USE the words “moved to love” in an effort to define the significant, important territory between “born this way” and choice.
zh_cn: 我之所以用“通过感知爱上”这几个字眼时为了划清“生来如此”和“选择”这两者之间的领土。

source: That solid ground covers “built this way,” “oriented this way,” and “evolved this way”; it incorporates the possibility of a potent biological predisposition mingling with other factors beyond anyone’s ready control; and it probably applies to Nixon herself.
zh_cn: 这块坚实的土地上涵盖着“生来如此”，“本来就朝着的方向”，“变成这样”；包含着人为不可控因素的潜在生物倾向的可能性；或许这只适合尼克松（Nixon）一个人。

source: In a Daily Beast interview after the Times article appeared, she clarified that she has experienced an unforced, undeniable attraction to individuals of both sexes.
zh_cn: 在《泰晤士报》一篇文章之后的一个叫做Daily Beast 的访谈上说，尼克松（Nixon）澄清了她同时对两性都有性吸引力的经历是自愿的，不可否认的。

source: In other words, she’s bisexual, not whimsical.
zh_cn: 换句话说，她是双性的，而不是古怪的。

source: She just happens not to like that term, she said.
zh_cn: 她说她之所以这么说是因为她不太喜欢古怪这个词。
